[
  {
    "SongNo": 1,
    "Lyrics": [
      "1. Praise Him ! (2) JESUS, our Blessed Redeemer; n:Sing, O earth! His wonderful love proclaim! n:Hail Him ! (2) highest archangels in glory; n:Strength and honour, give to His holy name, n:Like a Shepherd, Jesus will guard His children, n:In His arms He carries them all day long; n:O ye saints that dwell in the mountains of Zion, n:Praise Him !(2) ever in joyful sound. n: n:2. Praise Him !(2) JESUS our Blessed Redeemer; n:For our sins He suffered and bled and died; n:HE, our Rock, our Hope of eternal salvation, n:Hail Him !(2) Jesus the crucified, n:Loving Saviour, meekly enduring sorrow, n:Crowned with thorns that cruelly pierced His brow; n:Once for us rejected, despised, and forsaken, n:Prince of Glory, ever triumphant now. n: n:3. Praise Him! (2) JESUS, our Blessed Redeemer, n:Heavenly portals, loud with hosannas ring! n:Jesus, Saviour, reigneth for- ever and ever n:Crown Him! (2) Prophet and Priest and King! n:Death is vanquished! tell it with joy, ye faithful, n:Where is now thy victory boasting grave? n:Jesus lives! no longer thy portals are cheerless; n:Jesus lives, the Mighty and strong to save."
    ],
    "Writer": "F. J. Crossby"
  },
  {
    "SongNo": 2,
    "Lyrics": [
      "1. Holy !(3) Lord God Almighty! n:Early in the morning our songs shall rise to Thee; n:Holy !(3) merciful and mighty! n:God in three persons, Blessed Trinity! n: n:2. Holy !(3) all the saints adore Thee, n:Casting down their golden crowns around the glassy sea; n:Cherubim and Seraphim falling down before Thee, n:Who wert, and art, and evermore shall be. n: n:3. Holy !(3) though the darkness hide Thee, n:Though the eye of sinful man Thy glory may not see; n:Only Thou art Holy, there is none beside Thee, n:Perfect in power, in love and purity. n: n:4. Holy !(3) Lord God Almighty n:All Thy works shall praise Thy name in earth, and sky, and sea: n:Holy !(3) Merciful and Mighty n:God in three persons, Blessed Trinity!"
    ],
    "Writer": "R. Heber"
  },
  {
    "SongNo": 3,
    "Lyrics": [
      "1. To God be the glory! great things He hath done; n:So loved He the world that He gave us His Son ; n:Who yielded His life an atonement for sin, n:And opened the Life–gate that all may go in. n: n:i:Praise the Lord !(2) let the earth hear His voice! n:i:Praise the Lord !(2) let the people rejoice! n:i:Oh, come to the Father, through Jesus the Son; n:i:And give Him the glory–– great things He hath done! n: n:2. O perfect redemption, the purchase of Blood, n:To every believer the promise of God; n:The vilest offender who truly believes, n:That moment from Jesus a pardon receives. n: n:3. Great things He hath taught us, great things He hath done, n:And great our rejoicing through Jesus The Son; n:But purer, and higher, and greater will be n:Our wonder, our transport, when Jesus we see."
    ],
    "Writer": "F. J. Crossby"
  },
  {
    "SongNo": 4,
    "Lyrics": [
      "1. O Lord my God! when I in awesome wonder n:Consider all the works Thy hand hath made, n:I see the stars, I hear the mighty thunder, n:Thy power throughout the universe displayed. n: n:i:Then sings my soul my Saviour God to Thee n:i:How great Thou art! How great Thou art! – 2 n: n:2. When through the woods and forest glades I wander n:And hear the birds sing sweetly in the trees; n:When I look down from lofty mountain grandeur n:And hear the brook, and feel the gentle breeze. n: n:3. And when I think that God, His Son not sparing n:Sent Him to die––I scarce can take it in; n:That on the cross, my burden gladly bearing n:He bled and died, to take away my sin. n: n:4. When Christ shall come with shout of acclamation n:And take me home––what joy shall fill my heart n:Then shall I bow in humble adoration, n:And there proclaim, my God, how great Thou art!"
    ],
    "Writer": "Translated from Russian by S. K. Hine, 1948"
  },
  {
    "SongNo": 5,
    "Lyrics": [
      "1. All hail the power of Jesus’ name n:Let angels prostrate fall; n:Bring forth the royal diadem, n:And crown Him Lord of all. n: n:2. Crown Him, ye martyrs of our God n:Who from His altar call; n:Extol the stem of Jesse’s rod, n:And crown Him Lord of all. n: n:3. Ye saints redeemed of Adam’s race, n:Ye ransomed from the fall; n:Hail Him who saves you by His grace, n:And crown Him Lord of all. n: n:4. Sinners! whose love can ne’er forget n:The wormwood and the gall; n:Go spread your trophies at His feet, n:And crown Him Lord of all. n: n:5. Let every kindred, every tribe n:On this terrestrial ball, n:To Him all majesty ascribe, n:And crown Him Lord of all. n: n:6. Oh, that with yonder sacred throng n:We at His feet may fall, n:Join in the everlasting song, n:And crown Him Lord of all."
    ],
    "Writer": "E. Perronet"
  },
  {
    "SongNo": 6,
    "Lyrics": [
      "1. I will sing of my Redeemer, n:And His wondrous love to me; n:On the cruel cross He suffered, n:From the curse to set me free. n: n:i:Sing, oh sing of my Redeemer! n:i:With His blood He purchased me! n:i:On the cross he sealed my pardon, n:i:Paid the debt, and made me free. n: n:2. I will tell the wondrous story, n:How my lost estate to save, n:In His boundless love and mercy, n:He the ransom freely gave. n: n:3. I will praise my dear Redeemer, n:His triumphant power I’ll tell n:How the victory He giveth n:Over sin, and death, and hell. n: n:4. I will sing of my Redeemer, n:And His heavenly love to me, n:He from death to life hath brought me, n:Son of God, with Him to be."
    ],
    "Writer": "P. P. Bliss"
  },
  {
    "SongNo": 7,
    "Lyrics": [
      "1. Fairest of all the earth beside, n:Chiefest of all unto Thy bride, n:Fullness Divine in Thee I see, n:Wonderful man of Calvary. n: n:i:That Man of Calvary n:i:Has won my heart from me n:i:And died to set me free; n:i:Blest man of Calvary. n: n:2. Granting the sinner life and peace, n:Granting the captives sweet release, n:Shedding His blood to make us free, n:Merciful man of Calvary. n: n:3. Giving the gifts obtained for men, n:Pouring out love beyond our ken, n:Giving us spotless purity, n:Bountiful man of Calvary. n: n:4. Comfort of all my earthly way, n:Jesus I’ll meet Thee some sweet day, n:Centre of glory, Thee I’ll see, n:Wonderful man of Calvary."
    ],
    "Writer": "M. P. Ferguson"
  },
  {
    "SongNo": 8,
    "Lyrics": [
      "1. King of my life, I crown Thee now, n:Thine shall the glory be, n:Lest I forget Thy thorn–crowned brow, n:Lead me to Calvary. n: n:i:Lest I forget Gethsemane, n:i:Lest I forget Thine agony; n:i:Lest I forget Thy love for me, n:i:Lead me to Calvary. n: n:2. Show me the tomb where Thou wast laid, n:Tenderly mourned and wept, n:Angels in robes of light arrayed n:Guarded Thee whilst Thou slept. n: n:3. Let me like Mary, through the gloom, n:Come with a gift to Thee; n:Show to me now the empty tomb, n:Lead me to Calvary. n: n:4. May I be willing Lord to bear n:Daily my cross for Thee; n:Even the cup of grief to share, n:Thou hast borne all for me."
    ],
    "Writer": "J. E.  Hussey"
  },
  {
    "SongNo": 9,
    "Lyrics": [
      "1. When I survey the wondrous cross n:On which the Prince of Glory died, n:My richest gain I count but loss, n:And pour contempt on all my pride. n: n:2. Forbid it, Lord, that I should boast, n:Save in the cross of Christ my God; n:All the vain things that charm me most, n:I sacrifice them to His blood. n: n:3. See from His head, His hands, His feet, n:Sorrow and love flow mingled down; n:Did e’er such love and sorrow meet, n:Or thorns compose so rich a crown? n: n:4. Were the whole realm of nature mine, n:That were an offering far too small; n:Love so amazing, so Divine, n:Demands my soul, my life, my all."
    ],
    "Writer": "I. Watts"
  },
  {
    "SongNo": 10,
    "Lyrics": [
      "1. The love that Jesus had for me, n:To suffer on the cruel tree, n:That I a ransom soul might be, n:Is more than tongue can tell! n: n:i:His love is more than tongue can tell! (2) n:i:The love that Jesus had for me n:i:Is more than tongue can tell! n: n:2. The bitter sorrow that He bore, n:And oh, the crown of thorns He wore, n:That I might live for evermore, n:Is more than tongue can tell! n: n:3. The peace I have in Him, my Lord n:Who pleads before the throne of God, n:The merit of His precious blood, n:Is more than tongue can tell! n: n:4. The joy that comes when He is near, n:The rest He gives, so free from fear, n:The hope in Him, so bright and clear, n:Is more than tongue can tell!"
    ],
    "Writer": "J. E. Hall"
  },
  {
    "SongNo": 11,
    "Lyrics": [
      "1.  Now, in a song of grateful praise, n:To my dear Lord my voice I’ll raise; n:With all His saints I’ll join to tell, n:My Jesus has done all things well. n: n:i:And above the rest this note shall swell, n:i:This note shall swell, this note shall swell; n:i:And above the rest this note shall swell; n:i:My Jesus has done all things well! n: n:2. How sovereign, wonderful, and free, n:Has been His love to sinful me! n:He plucked me from the jaws of hell; n:My Jesus has done all things well. n: n:3. Though many a fiery flaming dart n:The tempter levels at my heart–– n:With this I all His rage repel: n:My Jesus has done all things well. n: n:4. And when to that bright world I rise, n:And claim my mansion in the skies, n:Above the rest this note shall swell: n:My Jesus has done all things well."
    ],
    "Writer": null
  },
  {
    "SongNo": 12,
    "Lyrics": [
      "1. On a hill far away stood an old rugged cross n:The emblem of suffering and shame n:And I love that old cross n:Where the dearest and blest n:For a world of lost sinners was slain n: n:i:So I’ll cherish the old rugged cross n:i:Till my trophies at last I lay down n:i:I will cling to the old rugged cross n:i:And exchange it someday for a crown. n: n:2. Oh! The old rugged cross n:So despised by the world n:Has a wondrous attraction for me n:For the dear Lamb of God n:Left His glory above n:To bear it to dark calvary. n: n:3. To the old rugged cross I will ever be true n:Its shame and reproach gladly bear n:Then he’ll call me some day n:To my home far away n:Where His glory for ever I’ll share."
    ],
    "Writer": null
  },
  {
    "SongNo": 13,
    "Lyrics": [
      "1. Rejoice and be glad ! the Redeemer has come n:Go look on His cradle, His cross, and His tomb. n: n:i:Sound His praises ! tell the story of Him who was slain ! n:i:Sound His praises ! tell with gladness, He liveth again ! n: n:2. Rejoice and be glad ! it is sunshine at last n:The clouds have departed, the shadows are past. n: n:3. Rejoice and be glad ! for the blood hath been shed; n:Redemption is finished, the price hath been paid. n: n:4. Rejoice and be glad ! now the pardon is free! n:The Just for the unjust has died on the tree. n: n:5. Rejoice and be glad ! for the Lamb that was slain n:O'er death is triumphant, and liveth again. n: n:6. Rejoice and be glad ! for our King is on high ; n:He pleadeth for us on His throne in the sky. n: n:7. Rejoice and be glad ! for He cometh again; n:He cometh in glory, the Lamb that was slain. n:Sound His praises ! tell the story of Him who was slain! n:Sound His praises ! tell with gladness, He cometh again!"
    ],
    "Writer": null
  },
  {
    "SongNo": 14,
    "Lyrics": [
      "1. Be glad in the Lord, and rejoice, n:All ye that are upright in heart; n:And ye that have made Him your choice, n:Bid sadness and sorrow depart. n: n:i:Rejoice !(2) n:i:Be glad in the Lord and rejoice! (2) n: n:2. Be joyful, for He is the Lord, n:On earth and in heaven supreme, n:He fashions and rules by His word n:The “mighty” and “strong” to redeem. n: n:3. What though in the conflict for right n:Your enemies almost prevail! n:God’s armies, just hid from your sight, n:Are more than the foes which assail. n: n:4. Though darkness surround you by day, n:Your sky by the night be o’ercast, n:Let nothing your spirit dismay, n:But trust till the danger is past. n: n:5. Be glad in the Lord and rejoice, n:His praises proclaiming in song: n:With harp and with organ, and voice, n:The loud hallelujahs prolong!"
    ],
    "Writer": "M. E. Servoss"
  },
  {
    "SongNo": 15,
    "Lyrics": [
      "1. I feel like singing all the time, n:My tears are wiped away; n:For Jesus is a friend of mine, n:I’ll serve Him every day.  n:i:I’ll praise Him! praise Him! n:i:Praise Him all the time! n:i:Praise Him! Praise Him! n:i:I’ll praise Him all the time! n: n:2. When on the cross my Lord I saw, n:Nailed there by sins of mine, n:Fast fell the burning tears; n:But now I’m singing all the time. n: n:3. When fierce temptations try my heart, n:I’ll sing, “Jesus is mine!” n:And so though tears at times may start n:I’m singing all the time. n: n:4. The wondrous story of the Lamb n:Tell with that voice of thine, n:Till others, with the glad new song, n:Go singing all the time."
    ],
    "Writer": null
  },
  {
    "SongNo": 16,
    "Lyrics": [
      "1. Oh worship the king , n:All – glorious above; n:O, gratefully sing n:His power and His love: n:Our shield and defender, n:The Ancient of Days, n:Pavilioned in splendour, n:And girded with praise. n: n:2. O, tell of His might, n:O, sing of His grace, n:Whose robe is the light, n:Whose canopy space; n:His chariots of wrath n:The deep thunder clouds form, n:And dark is His path n:On the wings of the storm. n: n:3. Frail children of dust, n:And feeble as frail, n:In Thee do we trust, n:Nor find Thee to fail; n:Thy mercies how tender, n:How firm to the end, n:Our maker, defender, n:Redeemer, and Friend. n: n:4. O measureless might, n:Ineffable love, n:While angels delight n:To hymn Thee above, n:Thy humbler creation, n:Though feeble their lays, n:With True Adoration n:Shall sing to Thy praise."
    ],
    "Writer": "R. Grant"
  },
  {
    "SongNo": 17,
    "Lyrics": [
      "1. O, for a thousand tongues to sing n:My great Redeemer’s praise! n:The glories of my God and King, n:The triumphs of His grace. n: n:2. Jesus the name that charms our fears, n:That bids our sorrows cease; n:‘Tis music in the sinner’s ears, n:‘Tis life, and health, and peace. n: n:3. He speaks, and, listening to His voice, n:New life the dead receive, n:The mournful, broken hearts rejoice, n:The humble poor believe. n: n:4. Hear Him, ye deaf; His praise ye, dumb, n:Your loosened tongues employ; n:Ye blind behold your Saviour come; n:And leap, ye lame, for joy! n: n:5. See all your sins on Jesus laid: n:The Lamb of God was slain, n:His soul was once an offering made n:For every soul of man. n: n:6. He breaks the power of cancelled sin, n:He sets the prisoner free; n:His blood can make the foulest clean, n:His blood availed for me. n: n:7. My Gracious Master and my God, n:Assist me to proclaim, n:And spread through all the earth abroad n:The honours of Thy name."
    ],
    "Writer": "C. Wesley"
  },
  {
    "SongNo": 18,
    "Lyrics": [
      "1. Jesus our Lord, with what joy we adore Thee, n:Chanting our praise to Thyself on the throne! n:Blest in Thy presence we worship before Thee, n:Own Thou art worthy, and worthy alone. n: n:i:Lord, Thou art worthy (2) n:i:Lord, Thou art worthy, and worthy alone! n:i:Blest in Thy presence we worship before Thee, n:i:Own Thou art worthy, and worthy alone. n: n:2. Verily God, yet become truly human –– n:Lower than angels––to die in our stead; n:How hast Thou, long––promised “Seed of the woman”, n:Trod on the serpent and bruised his head! n: n:3. How didst thou humble Thyself to be taken, n:Led by Thy creatures and nailed to the cross! n:Hated of men, and of God, too forsaken, n:Shunning not darkness, the curse and the loss! n: n:4. How hast Thou triumphed, and triumphed with glory n:Battled death’s forces, rolled back every wave! n:Can we refrain, then, from telling the story? n:Lord, Thou art victor o’er death and the grave."
    ],
    "Writer": "H. D’A. Champney"
  },
  {
    "SongNo": 19,
    "Lyrics": [
      "1. Behold, what love, what boundless love, n:The Father hath bestowed n:On sinners lost, that we should be n:Now called the sons of God. n: n:i:“Behold… what manner of love…. n:i:What manner of love the Father n:i:Hath bestowed upon us, that We…. n:i:...that we should be called.... n:i:Should be called the sons of God.” n: n:2. No longer far from Him, but now n:By precious blood made nigh; n:Accepted in the well – beloved, n:Near to God’s heart we lie. n: n:3. What we in glory soon shall be, n:It doth not yet appear; n:But when our precious Lord we see, n:We shall His image bear. n: n:4. With such a blessed hope in view, n:We should more holy be, n:More like our Risen, Glorious Lord, n:Whose face we soon shall see."
    ],
    "Writer": "Samuel Medley"
  },
  {
    "SongNo": 20,
    "Lyrics": [
      "1. Lamb of God! our souls adore Thee n:While upon Thy face we gaze; n:There the Father’s love and glory n:Shine in all their brightest rays, n:Thine Almighty power and wisdom n:All creations works proclaim; n:Heaven and earth alike confess Thee n:As the ever great I Am. n: n:2. Lamb of God! Thy father’s bosom n:Ever was Thy dwelling place; n:His delight in Him rejoicing, n:One with Him in power and grace; n:O what wondrous love and mercy! n:Thou didst lay Thy glory by, n:And for us didst come from Heaven, n:As the Lamb of God, to die. n: n:3. Lamb of God! when we behold Thee n:Lowly in the manger laid; n:Wand’ring as a homeless stranger n:In the world Thy hands had made; n:When we see Thee in the garden, n:In Thine agony of blood; n:At Thy grace we are confounded, n:Holy, spotless Lamb of God. n: n:4. When we see Thee, as the victim, n:Bound to the accursed tree, n:For our guilt and folly stricken, n:All our judgements borne by Thee, n:Lord we own, with hearts adoring, n:Thou hast loved us unto blood, n:Glory, glory everlasting, n:Be to Thee, Thou Lamb of God."
    ],
    "Writer": "James G. Deck"
  },
  {
    "SongNo": 21,
    "Lyrics": [
      "1. Loved with everlasting love, n:Led by grace that love to know; n:Spirit breathing from above, n:Thou has taught me it is so, n:Oh, this full and prefect peace; n:Oh, this transport all Divine; n:In a love which cannot cease, n:I am His, and He is mine. n: n:2. Heaven above is softer blue, n:Earth around is sweeter green; n:Something lives in ev’ry hue n:Christless eyes have never seen: n:Birds with gladder songs o’erflow, n:Flowers with deeper beauty shine, n:Since I know, as now I know, n:I am His, and He is mine. n: n:3. Things that once were wild alarms n:Cannot now disturb my rest; n:Closed in everlasting arms, n:Pillowed on the Loving breast. n:Oh, to lie for ever here, n:Doubt and care and self resign, n:While He whispers in my ear, n:I am His, and He is mine. n: n:4. His for ever, only His; n:Who the Lord and me shall part? n:Ah, whith what a rest of bliss n:Christ can fill the loving heart. n:Heaven and earth may fade and flee, n:First – born light in gloom decline; n:But, while God and I shall be, n:I am His, and He is mine."
    ],
    "Writer": "W. Robinson"
  },
  {
    "SongNo": 22,
    "Lyrics": [
      "1. My Redeemer! O what beauties n:In that lovely name appear; n:None but Jesus in His glories, n:Shall the honoured title wear. n:My Redeemer! My Redeemer n:Thou hast my salvation wrought. n: n:2. Sunk in ruin, sin and misery, n:Bound by satan’s captive chain, n:Guided by His artful treachery, n:Hurrying on to endless pain; n:My Redeemer! My Redeemer n:Plucked me as a brand from hell. n: n:3. Mine by covenant, mine for ever, n:Mine by oath, and mine by blood, n:Mine––nor time the bond shall sever n:Mine as an unchanging God. n:My Redeemer! My Redeemer n:O how sweet to call Thee mine! n: n:4. When in heaven I see Thy glory, n:When before Thy throne I bow, n:Perfected I shall be like Thee, n:Fully Thy redemption know. n:My Redeemer! My Redeemer n:Then shall hear me shout His praise."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 23,
    "Lyrics": [
      "1. Through Thy precious body broken n:Inside the veil; n:O what words to sinners spoken n:Inside the veil! n:Precious as the blood that bought us, n:Perfect as the love that sought us, n:Holy as the Lamb that brought us n:Inside the veil. n: n:2. When we see Thy love unshaken n:Outside the camp; n:Scorned by man, by God forsaken, n:Outside the camp; n:Thy loved cross alone can charm us, n:Shame need now no more alarm us, n:Glad we follow, nought can harm us n:Outside the camp. n: n:3. Lamb of God, through Thee we enter n:Inside the veil; n:Cleansed by Thee, we boldly venture n:Inside the veil; n:Not a stain; a new creation; n:Ours is such a full salvation; n:Low we bow in adoration n:Inside the veil. n: n:4. Unto Thee, the homless stranger, n:Outside the camp, n:Forth we hasten, fear no danger n:Outside the camp, n:Thy reproach, far richer treasure n:Than all Egypt’s boasted pleasure; n:Drawn by love that knows no measure, n:Outside the camp. n: n:5. Soon Thy saints shall all be gathered n:Inside the veil; n:All at home, no more be scattered, n:Inside the veil. n:Nought from Thee our hearts shall sever: n:We shall see Thee, grieve Thee never; n:“Praise the Lamb!”  shall sound for ever n:Inside the veil"
    ],
    "Writer": "Elizabeth Dark"
  },
  {
    "SongNo": 24,
    "Lyrics": [
      "1. Who can cheer the heart like Jesus n:By His presence all Divine? n:True and tender, pure and precious, n:O how blest to call Him mine! n: n:i:All that thrills my soul is Jesus; n:i:He is more than life to me; n:i:And the fairest of ten thousand, n:i:In my blessed Lord I see. n: n:2. Love of Christ so freely given, n:Grace of God beyond degree, n:Mercy higher than the heaven, n:Deeper than the deepest sea. n: n:3. What a wonderful redemption! n:Never can a mortal know n:How my sin though red like crimson, n:Can be whiter than the snow. n: n:4. Every need His hand supplying, n:Every good in Him I see; n:On His strength Divine relying, n:He is all in all to me. n: n:5. By the crystal flowing river n:With the ransomed I will sing, n:And for ever and for ever, n:Praise and glorify the King."
    ],
    "Writer": "Thoro Harris"
  },
  {
    "SongNo": 25,
    "Lyrics": [
      "1. Low in the grave He lay–– n:Jesus, my Saviour! n:Waiting the coming day–– n:Jesus, my Lord! n: n:i:Up from the grave He arose, n:i:With a mighty triumph o’er His foes; n:i:He arose a Victor from the dark domain n:i:And He lives for ever with His saints to reign: n:i:He arose! He arose! n:i:Hallelujah! Christ arose! n: n:2. Vainly they watch His bed–– n:Jesus, my Saviour n:Vainly they seal The Dead–– n:Jesus, my Lord. n: n:3. Death cannot keep His prey–– n:Jesus, my Saviour n:He tore the bars away–– n:Jesus, my Lord."
    ],
    "Writer": "R. Lowry"
  },
  {
    "SongNo": 26,
    "Lyrics": [
      "1. The great Physician now is near, n:The Sympathising Jesus; n:He speaks the drooping heart to cheer, n:Oh, hear the voice of Jesus! n: n:i:Sweetest note in seraph song, n:i:Sweetest name on mortal tongue, n:i:Sweetest carol ever sung: n:i:Jesus! blessed Jesus! n: n:2. Your many sins are all forgiven; n:Oh, hear the voice of Jesus! n:Go on your way in peace to heaven, n:And wear a crown with Jesus. n: n:3. All glory to the Risen Lamb! n:I now believe in Jesus; n:I love the blessed Saviour’s Name, n:I love the name of Jesus. n: n:4. Come, brethren, help me sing His praise, n:Oh, praise the name of Jesus! n:Come, sisters, all your voices raise, n:Oh, bless the Name of Jesus! n: n:5. And when to the bright world above n:We rise to see our Jesus, n:We’ll sing around the throne of love n:His Name, the Name of Jesus."
    ],
    "Writer": "W. Huntel"
  },
  {
    "SongNo": 27,
    "Lyrics": [
      "1. Have you been to Jesus for the cleansing power? n:Are you washed in the blood of the Lamb? n:Are you fully trusting in His grace this hour? n: n:i:Are you washed in the blood of the Lamb? n:i:Are you washed in the blood, n:i:In the soul cleansing blood of the Lamb? n:i:Are your garments spotless, n:i:Are they white as snow? n:i:Are you washed in the blood of the Lamb? n: n:2. Are you walking daily by the Saviour’s side? n:Are you washed in the blood of the Lamb? n:Do you rest each moment in the Crucified? n:Are you washed in the blood of the Lamb? n: n:3. When the bridegroom cometh will your robes be white? n:Pure and white in the blood of the Lamb? n:Will your soul be ready for the mansions bright, n:And be washed in the blood of the Lamb? n: n:4. Lay aside the garments that are stained with sin. n:And be washed in the blood of the Lamb! n:There’s a fountain flowing for the soul unclean –– n:Oh, be washed in the blood of the Lamb."
    ],
    "Writer": "E. A. Hoffman"
  },
  {
    "SongNo": 28,
    "Lyrics": [
      "1. Would you be free from your burden of sin? n:There’s power in the blood, power in the blood n:Would you o’er evil a victory win? n:There’s wonderful power in the blood. n: n:i:There is power, power, n:i:Working power n:i:In the blood of the Lamb; n:i:There is power, power, n:i:Wonder working power, n:i:In the precious blood of the Lamb. n: n:2. Would you be free from your passion and pride? n:There’s power in the blood, power in the blood; n:Come for a cleansing to Calvary’s tide, n:There’s wonderful power in the blood. n: n:3. Would you be whiter, much whiter than snow? n:There’s power in the blood, power in the blood, n:Sin–stains are lost in its life–giving flow, n:There’s wonderful power in the blood. n: n:4. Would you do service for Jesus your King? n:There’s power in the blood, power in the blood; n:Would you live daily His praises to sing? n:There’s wonderful power in the blood."
    ],
    "Writer": "L. F. Jones"
  },
  {
    "SongNo": 29,
    "Lyrics": [
      "1. My hope is built on nothing less n:Than Jesus’ blood and righteousness; n:I dare not trust the sweetest frame, n:But wholly lean on Jesus’ name. n: n:i:On Christ, the Solid Rock, I stand; n:i:All other ground is sinking sand, n:i:All other ground is sinking sand. n: n:2. When darkness seems to veil His face, n:I rest on His unchanging grace; n:In ev’ry high and stormy gale n:My anchor holds within the vail. n: n:3. His oath, His covenant, His blood, n:Support me in the ‘whelming flood; n:When all around my soul gives way, n:He then is all my hope and stay. n: n:4. And when I hear the trumpet sound, n:Oh, may I then in Him be found, n:Clothed in His righteousness alone, n:Faultless to stand before His throne."
    ],
    "Writer": "E. Mote"
  },
  {
    "SongNo": 30,
    "Lyrics": [
      "1. In tenderness He sought me, n:Weary and sick with sin, n:And on His shoulders brought me n:Back to His fold again; n:While angels in His presence sang, n:Until the courts of heaven rang. n: n:i:Oh, the love that sought me! n:i:Oh, the blood that bought me! n:i:Oh, the grace that brought me to the fold, n:i:Wondrous grace that brought me to the fold! n: n:2. He wash’d the bleeding sin–wounds, n:And pour’d in oil and wine; n:He whisper’d to assure me, n:I’ve found Thee, thou art Mine n:I never heard a sweeter voice, n:It made my aching heart rejoice. n: n:3. He pointed to the nail–prints, n:For me His blood was shed, n:A mocking crown so thorny n:Was placed upon His head: n:I wonder’d what He saw in me n:To suffer such deep agony. n: n:4. I’m sitting in His presence, n:The sunshine of His face, n:While with adoring wonder n:His blessings I retrace, n:It seems as if eternal days n:Are far too short to sound His praise. n: n:5. So while the hours are passing, n:All now is perfect rest; n:I’m waiting for the morning, n:The brightest and the best, n:When He will call us to His side, n:To be with Him His spotless bride."
    ],
    "Writer": "W. Spencer Walton"
  },
  {
    "SongNo": 31,
    "Lyrics": [
      "1. Amazing grace! how sweet the sound n:That saved a wretch like me; n:I once was lost, but now am found; n:Was blind, but now I see. n: n:2. ‘Twas grace that taught my heart to fear, n:And grace my fears relieved; n:How precious did that grace appear n:The hour I first believed! n: n:3. Through many dangers, toils and snares n:I have already come: n:‘Tis grace that brought me safe thus far, n:And grace will lead me home. n: n:4. The Lord has promised good to me, n:His word my hope secure; n:He will my shield and portion be, n:As long as life endures. n: n:5. Yes, when this heart and flesh shall fail, n:And mortal life shall cease, n:I shall posses within the veil n:A life of joy and peace. n: n:6. When we’ve been there a thousand years, n:Bright shining as the sun, n:We’ve no less days to sing God’s praise n:Than when we’d first begun."
    ],
    "Writer": "J. Newton"
  },
  {
    "SongNo": 32,
    "Lyrics": [
      "1. Blessed assurance, Jesus is mine: n:Oh, what a foretaste of glory Divine; n:Heir of salvation, purchased of God; n:Born of His spirit, washed in His blood. n: n:i:This is my story, n:i:This is my song, n:i:Praising my saviour n:i:All the day long n: n:2. Perfect submission, perfect delight, n:Visions of rapture burst on my sight; n:Angels descending, bring from above n:Echoes of mercy, whispers of love. n: n:3. Perfect submission, all is at rest, n:I in my Saviour am happy and blest; n:Watching and waiting, looking above, n:Filled with His goodness, lost in His love."
    ],
    "Writer": "F. J. crosby"
  },
  {
    "SongNo": 33,
    "Lyrics": [
      "1. Love Divine all loves excelling, n:Joy of heaven, to earth come down; n:Fix in us Thy humble dwelling, n:All Thy faithful mercies crown n:Jesus, Thou art all compassion, n:Pure, unbounded love Thou art; n:Visit us with Thy salvation, n:Enter every trembling heart. n: n:2. Breathe, oh breathe Thy loving Spirit n:Into every troubled breast! n:Let us all in Thee inherit, n:Let us find Thy promised rest n:Take away the love of sinning, n:Alpha and Omega be; n:End of faith, as its beginning, n:Set our hearts at liberty. n: n:3. Come, Almighty, to deliver: n:Let us all Thy grace receive; n:Suddenly return, and never, n:Never more Thy temples leave. n:Thee we would be always blessing, n:Serve Thee as Thy hosts above, n:Pray and praise Thee without ceasing, n:Glory in Thy perfect love. n: n:4. Finish, then, the new creation, n:Pure and spotless may we be; n:Let us see Thy great salvation n:Perfectly restored in Thee: n:Changed from glory into glory, n:Till in heaven we take our place; n:Till we cast our crowns before Thee, n:Lost in wonder, love, and praise."
    ],
    "Writer": "C. Wesley"
  },
  {
    "SongNo": 34,
    "Lyrics": [
      "1. I need Thee ev’ry hour, most Gracious Lord; n:No tender voice like Thine can peace afford. n: n:i:I need Thee, Oh, I need Thee; n:i:Every hour I need Thee; n:i:Oh, bless me now, my Saviour! n:i:I come to Thee. n: n:2. I need Thee ev’ry hour, stay Thou nearby; n:Temptations lose their power, when Thou art nigh. n: n:3. I need Thee ev’ry hour, in joy or pain; n:Come quickly and abide, or life is vain. n: n:4. I need Thee ev’ry hour, teach me Thy will; n:And Thy rich promises, in me fulfil. n: n:5. I need Thee ev’ry hour, most Holy One; n:Oh, make me Thine indeed, Thou Blessed Son."
    ],
    "Writer": "A. S. Hawks"
  },
  {
    "SongNo": 35,
    "Lyrics": [
      "1. Jesus, keep me near the Cross; n:There a precious fountain, n:Free to all, a healing stream, n:Flows from calv’ry’s mountain. n: n:i:In the Cross, in the Cross, n:i:Be my glory ever; n:i:Till my raptured soul shall find n:i:Rest beyond the river. n: n:2. Near the cross, a trembling soul, n:Love and mercy found me; n:There the bright and morning star, n:Shed it’s beams around me. n: n:3. Near the Cross, O Lamb of God, n:Bring its scenes before me n:Help me walk from day to day, n:With its shadows o’er me. n: n:4. Near the cross I’ll watch and wait, n:Hoping, trusting ever, n:Till I reach the golden strand, n:Just beyond the river."
    ],
    "Writer": "F. J. Crosby"
  },
  {
    "SongNo": 36,
    "Lyrics": [
      "1. More about Jesus would I know, n:More of His grace to others show; n:More of His saving fullness see, n:More of His love who died for me. n: n:i:More, more about Jesus (2) n:i:More of His saving fullness see, n:i:More of His love who died for me. n: n:2. More about Jesus let me learn, n:More of His Holy will discern; n:Spirit of God my Teacher be, n:Showing the things of Christ to me. n: n:3. More about Jesus, in His word, n:Holding communion with my Lord; n:Hearing His voice in ev’ry line, n:Making each faithful saying mine. n: n:4. More about Jesus on the throne, n:Riches in glory all His own; n:More of His kingdom’s sure increase; n:More of His coming, Prince of Peace."
    ],
    "Writer": "E. E. Hewitt"
  },
  {
    "SongNo": 37,
    "Lyrics": [
      "1. What a Friend we have in Jesus, n:All our sins and griefs to bear! n:What a privilege to carry n:Everything to God in prayer! n:Oh, what peace we often forfeit, n:Oh, what needless pain we bear – n:All because we do not carry n:Everything to God in prayer! n: n:2. Have we trials and temptations? n:Is there trouble anywhere? n:We should never be discouraged; n:Take it to the Lord in prayer. n:Can we find a friend so faithful, n:Who will all our sorrows share? n:Jesus knows our every weakness – n:Take it to the Lord in prayer! n: n:3. Are we weak and heavy–laden, n:Cumbered with a load of care? n:Precious Saviour, still our refuge– n:Take it to the Lord in prayer, n:Do thy friends despise, forsake thee? n:Take it to the Lord in prayer; n:In His arms He’ll take and shield thee, n:Thou wilt find a solace there."
    ],
    "Writer": "J. Scriven"
  },
  {
    "SongNo": 38,
    "Lyrics": [
      "1. There’s a royal banner given for display n:To the soldiers of the King; n:As an ensign fair we lift it up to–day, n:While as ransomed ones we sing. n: n:i:Marching on! marching on! n:i:For Christ count everything but loss, n:i:And to crown Him King, toil and sing, n:i:‘Neath the banner of the cross! n: n:2. Though the foe may rage and gather as the flood, n:Let the standard be displayed! n:And beneath its folds, as soldiers of the Lord, n:For the truth be not dismayed! n: n:3. Over land and sea, wherever man may dwell, n:Make the glorious tidings known; n:Of the crimson banner now the story tell, n:While the Lord shall claim His own! n: n:4. When the glory dawns – ‘tis drawing very near; n:It is hastening day by day – n:Then before our King the foe shall disappear, n:And the cross the world shall sway!"
    ],
    "Writer": "El Nathan"
  },
  {
    "SongNo": 39,
    "Lyrics": [
      "1. Great is Thy faithfulness, O God my Father, n:There is no shadow of turning with Thee; n:Thou changest not, Thy compassions they fail not, n:As Thou hast been, Thou for ever wilt be. n: n:i:Great is Thy faithfulness; (2) n:i:Morning by morning new mercies I see; n:i:All I have needed Thy hand hath provided, n:i:Great is Thy faithfulness, Lord unto me. n: n:2. Summer and winter, and spring time and harvest, n:Sun, moon and stars in their courses above, n:Join with all nature in manifold witness, n:To Thy great faitfulness, mercy and love. n: n:3. Pardon for sin and a peace that endureth; n:Thy own dear presence to cheer and to guide; n:Strength for to–day and bright hope for to–morrow, n:Blessings all mine with ten thousand beside."
    ],
    "Writer": "T. O. Chisholm"
  },
  {
    "SongNo": 40,
    "Lyrics": [
      "1. Standing on the promises of Christ my king, n:Thro’ eternal ages let His praises ring, n:Glory in the highest, I will shout and sing, n:Standing on the promises of God. n: n:i:Standing, standing, n:i:Standing on the promises of God my Saviour; n:i:Standing, standing, n:i:I’m standing on the promises of God. n: n:2. Standing on the promises that cannot fail, n:When the howling storms of doubt and fear assail, n:By the Living Word of God I shall prevail, n:Standing on the promises of God. n: n:3. Standing on the promises I now can see n:Perfect, present cleansing in the blood for me; n:Standing in the liberty where Christ makes free, n:Standing on the promises of God. n: n:4. Standing on the promises of Christ the Lord, n:Bound to Him eternally by love’s strong cord, n:Overcoming daily with the Spirit’s sword, n:Standing on the promises of God. n: n:5. Standing on the promises I shall not fall, n:List’ning ev’ry moment to the Spirit’s call, n:Resting in my Saviour as my All in all, n:Standing on the promises of God."
    ],
    "Writer": "R. K. Carter"
  },
  {
    "SongNo": 41,
    "Lyrics": [
      "1. Light of the world n:You stepped down into darkness n:Opened my eyes, let me see n:Beauty that made, this heart adore You n:Hope of a life spent with You. n: n:i:Here I am to worship n:i:Here I am to bow down n:i:Here I am to say that You’re my God n:i:You’re altogether worthy n:i:All together holy n:i:Altogether wonderful to me. n: n:2. King of all days n:Oh so highly exalted n:Glorious in heaven above n:Humbly you came n:To the earth You created n:All for love’s sake became poor."
    ],
    "Writer": "Tim Hughes"
  },
  {
    "SongNo": 42,
    "Lyrics": [
      "1. When upon Life’s billows you are tempest toss’d n:When you are discouraged, thinking all is lost, n:Count your many blessings: name them one by one, n:And it will surprise you what the Lord has done. n: n:i:Count your blessings: name them one by one, n:i:Count your blessings: see what God hath done; n:i:Count your blessings: name them one by one n:i:And it will surprise you what the Lord has done. n: n:2. Are you ever burden’d with a load of care? n:Does the cross seem heavy you are called to bear? n:Count your many blessings: ev’ry doubt will fly, n:And you will be singing as the days go by. n: n:3. When you look at others with their lands and gold, n:Think that Christ has promis’d you His wealth untold, n:Count your many blessings: money cannot buy n:Your reward in heaven, nor your home on high. n: n:4. So, amid the conflict, whether great or small, n:Do not be discouraged, God is over all, n:Count your many blessings: angels will attend, n:Help and comfort give you to your journey’s end."
    ],
    "Writer": "J. Oatman"
  },
  {
    "SongNo": 43,
    "Lyrics": [
      "1. Purify my heart n:Let me be as gold and precious silver n:Purify my heart n:Let me be as gold, pure gold. n: n:i:Refiner’s fire n:i:My heart’s one desire n:i:Is to be holy n:i:Set apart for you O Lord n:i:I choose to be holy n:i:Set apart for You, my Master n:i:Ready to do Your will. n: n:2. Purify my heart n:Cleanse me from within and make me holy n:Purify my heart n:Cleanse me from my sin, deep within."
    ],
    "Writer": "Brian Doerksen"
  },
  {
    "SongNo": 44,
    "Lyrics": [
      "1. Thou, my everlasting portion, n:More than friend or life to me, n:All along my pilgrim journey, n:Saviour, let me walk with Thee. n:Close to Thee, close to Thee, (2) n:All along my pilgrim journey, n:Saviour, let me walk with Thee. n: n:2. Not for ease or worldly pleasure, n:Not for fame my prayer shall be; n:Gladly will I toil and suffer, n:Only let me walk with Thee. n:Close to Thee, close to Thee, (2) n:Gladly will I toil and suffer, n:Only let me walk with Thee. n: n:3. Lead me through the vale of shadows, n:Bear me o’er life’s fitful sea; n:Then the gate of life eternal n:I shall enter, Lord, with Thee. n:Close to Thee, close to Thee, (2) n:Then the gate of life eternal n:I shall enter, Lord, with Thee."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 45,
    "Lyrics": [
      "1. Praise to the Lord, the Almighty, the King of creation; n:O my soul, praise Him, for He is thy health and salvation; n:All ye who hear, brothers and sisters draw near, n:Praise Him in glad adoration. n: n:2. Praise to the Lord, who doth prosper thy work and defend thee; n:Surely His goodness and mercy here daily attend thee; n:Ponder anew, what the Almighty can do, n:If with His Love He befriend thee. n: n:3. Praise to the Lord, who, when tempests their warfare are waging, n:Who, when the elements madly around thee are raging, n:Biddeth them cease, turneth their fury to peace, n:Whirlwinds and waters assuaging. n: n:4. Praise to the Lord, who when darkness and sin is abounding, n:Who, when the godless do triumph, all virtue confounding, n:Sheddeth His Light, chaseth the horrors of night, n:Saints with His mercy surrounding. n: n:5. Praise to the Lord! O let all that is in me adore Him n:All that hath life and breath, come now with praises before Him! n:Let the amen, sound from His people again: n:Gladly for aye we adore Him."
    ],
    "Writer": "Joachim Neander"
  },
  {
    "SongNo": 46,
    "Lyrics": [
      "1. Sweet hour of prayer! (2) n:That calls me from a world of care, n:And bids me at my Father’s throne n:Make all my wants and wishes known. n:In seasons of distress and grief, n:My soul has often found relief, n:And oft escaped the tempters snare, n:By thy return, sweet hour of prayer! n: n:2. Sweet hour of prayer! (2) n:Thy wings shall my petition bear n:To Him whose truth and faithfulness n:Engage the waiting soul to bless; n:And since He bids me seek His face, n:Believe His word, and trust His grace, n:I’ll cast on Him my every care, n:And wait for thee, sweet hour of prayer! n: n:3. Sweet hour of prayer !(2) n:May I thy consolation share, n:Till, from mount Pisgah’s lofty height, n:I view my home and take my flight. n:This robe of flesh I’ll drop, and raise n:To seize the everlasting prize; n:And shout, while passing through the air, n:“Farewell, farewell, sweet hour of prayer!”"
    ],
    "Writer": "W. W. Walford"
  },
  {
    "SongNo": 47,
    "Lyrics": [
      "1. We praise Thee, O God, for the Son of Thy love, n:For Jesus who died, and is now gone above. n: n:i:Hallelujah! Thine the glory, n:i:Hallelujah! Amen! n:i:Hallelujah! Thine the glory, n:i:Revive us again. n: n:2. We praise Thee, O God, for Thy Spirit of Light n:Who has shown us our Saviour and scattered our night. n: n:3. All glory and praise, to the Lamb that was slain n:Who has borne all our sins and has cleansed every stain. n: n:4. Revive us again, fill each heart with Thy love, n:May each soul be rekindled with fire from above."
    ],
    "Writer": "W. P. Mackay"
  },
  {
    "SongNo": 48,
    "Lyrics": [
      "1. There’s a call come ringing o’er the restless wave n:“Send the light! send the light” n:There are souls to rescue, there are souls to save n:Send the light! send the light. n: n:i:“Send the light! the blessed gospel light; n:i:Let it shine from shore to shore! n:i:Send the light the blessed gospel light; n:i:Let it shine for evermore!” n: n:2. We have heard the Macedonian call today n:Send the light, send the light n:And our grateful offering at the cross we lay n:Send the light, send the light. n: n:3. May the grace of Jesus unto all abound n:Send the light, send the light n:And a Christ-like Spirit everywhere be found n:Send the light, send the light. n: n:4. Let us not grow weary in the work of love n:Send the light, send the light n:While we gather jewels for our crown above n:Send the light, send the light."
    ],
    "Writer": "Charles H. Gabriel"
  },
  {
    "SongNo": 49,
    "Lyrics": [
      "1. “There shall be showers of blessing”; n:This is the promise of love, n:There shall be seasons refreshing, n:Sent from the Saviour above. n: n:i:Showers of blessing, n:i:Showers of blessing we need; n:i:Mercy–drops round us are falling, n:i:But for the showers we plead. n: n:2. “There shall be showers of blessing” – n:Precious reviving again; n:Over the hills and the valleys, n:Sound of abundance of rain. n: n:3. “There shall be showers of blessing”: n:Send them upon us, O Lord! n:Grant to us now a refreshing; n:Come, and now honour Thy word. n: n:4. “There shall be showers of blessing”: n:Oh, that to–day they might fall, n:Now as to God we’re confessing, n:Now as on Jesus we call!"
    ],
    "Writer": "El Nathan"
  },
  {
    "SongNo": 50,
    "Lyrics": [
      "1. Take the name of Jesus with you, n:Child of sorrow and of woe; n:It will joy and comfort give you– n:Take it then where’er you go. n: n:i:Precious name….. Oh, how sweet!.... n:i:Hope of earth and joy of heaven! n:i:Precious name…… Oh, how sweet!... n:i:Hope of earth and joy of heaven. n: n:2. Take the name of Jesus ever, n:As a shield from every snare; n:If temptations round you gather n:Breathe that Holy Name in prayer. n: n:3. Oh, the precious name of Jesus! n:How it thrills our souls with joy, n:When His loving arms receive us, n:And His songs our tongues employ. n: n:4. At the name of Jesus bowing, n:Falling prostrate at His feet, n:King of Kings in heaven we’ll crown Him n:When our journey is complete."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 51,
    "Lyrics": [
      "1. Sing them over again to me, n:Wonderful words of life! n:Let me more of their beauty see, n:Wonderful words of life! n:Words of life and beauty, n:Teach me faith and duty! n: n:i:Beautiful words! wonderful words! n:i:Wonderful words of life! n: n:2. Christ, the Blessed One, gives to all n:Wonderful words of life! n:Sinner, list to the loving call, n:Wonderful words of life! n:All so freely given, wooing us to heaven! n: n:3. Sweetly echo the gospel call! n:Wonderful words life! n:Offer pardon and peace to all! n:Wonderful words of life! n:Jesus, only saviour, sanctify for ever!"
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 52,
    "Lyrics": [
      "1. Come to the Saviour, make no delay; n:Here in His word He has shown us the way; n:Here in our midst he’s standing to–day, n:Tenderly saying, “come!” n: n:i:Joyful, joyful, will the meeting be, n:i:When from sin our hearts are pure and free; n:i:And we shall gather, Saviour, with Thee, n:i:In our eternal home. n: n:2. “Suffer the children!” oh, Hear His voice! n:Let every heart leap forth and rejoice; n:And let us freely make Him our choice n:Do not delay, but come. n: n:3. Think once again, He’s with us to–day; n:Heed now His blest command, and obey; n:Hear now His accents tenderly say, n:“Will you, my children, come?”"
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 53,
    "Lyrics": [
      "1. I am so glad that my Father in heaven n:Tells of His love in the book He has given: n:Wonderful things in the Bible I see; n:This is the dearest, that Jesus loves me. n: n:i:I am so glad that Jesus loves me, n:i:Jesus loves me, Jesus loves me, n:i:I am so glad that Jesus loves me, n:i:Jesus loves even me. n: n:2. Though I forget Him, and wander away, n:Still He doth love me wherever I stray; n:Back to His dear loving arms do I flee n:When I remember that Jesus loves me. n: n:3. Oh, if there’s only one song I can sing, n:When in His beauty I see the Great king, n:This shall my  song in eternity be, n:“Oh, what a wonder that Jesus loves me!” n: n:4. Jesus loves me, and I know I love Him: n:Love brought Him down my poor soul to redeem; n:Yes, it was love made Him die on the tree: n:Oh, I am certain that Jesus loves me! n: n:5. If one should ask of me, how can I tell? n:Glory to Jesus, I know very well! n:God’s Holy Spirit with mine doth agree, n:Constantly witnessing – Jesus loves me. n: n:6. In this assurance I find sweetest rest, n:Trusting in Jesus, I know I am blest; n:Satan; dismayed, from my soul now doth flee, n:When I just tell him that Jesus loves me."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 54,
    "Lyrics": [
      "1. There is a name I love to hear, n:I love to sing it’s worth; n:It sounds like music in my ear, n:The sweetest Name on earth. n: n:i:Oh! how I love, Jesus! (3) n:i:Because, He first loved me. n: n:2. It tells me of a Saviour’s love, n:Who died to set me free; n:It tells me of His precious blood, n:The sinner’s perfect plea. n: n:3. It bids my trembling soul rejoice, n:And dries each rising tear; n:It tells me in a “still, small voice”, n:To trust and never fear. n: n:4. Jesus, the name I love so well, n:The name I love to hear, n:No saint on earth its worth can tell, n:No heart conceive how dear. n: n:5. This name shall shed its fragrance still n:Along this thorny road, n:Shall sweetly smooth the rugged hill n:That leads me up to God. n: n:6. And there, with all the blood–bought throng, n:From sin and sorrow free, n:I’ll sing the new eternal song n:Of Jesus’ love to me."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 55,
    "Lyrics": [
      "1. ‘Tis so sweet to trust in Jesus, n:Just to take Him at His word; n:Just to rest upon His promise, n:Just to know, “Thus saith the Lord”. n: n:i:Jesus, Jesus, how I trust Him! n:i:How I’ve prov’d Him o’er and o’er! n:i:Jesus, Jesus, precious Jesus! n:i:Oh, for grace to trust Him more. n: n:2. Oh, how sweet to trust in Jesus, n:Just to trust His cleansing blood; n:Just in simple faith to plunge me, n:‘Neath the healing, cleansing flood. n: n:3. Yes, ‘tis sweet to trust in Jesus, n:Just from sin and self to cease; n:Just from Jesus simply taking, n:Life and rest, and joy and peace. n: n:4. I’m so glad I learned to trust Him, n:Precious Jesus, Saviour, Friend; n:And I know that Thou art with me, n:Wilt be with me to the end."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 56,
    "Lyrics": [
      "1. Shall we gather at the river n:Where bright angel-feet have trod; n:With the crystal tide for ever n:Flowing by the throne of God? n: n:i:Yes, we’ll gather at the river, n:i:The beautiful, the beautiful river; n:i:Gather with the saints at the river, n:i:That flows by the throne of God. n: n:2. On the margin of the river, n:Washing up its silver spray, n:We will walk and worship ever n:All the happy, golden day. n: n:3. Ere we reach the shining river, n:Lay we every burden down: n:Grace our spirits will deliver, n:And provide a robe and crown. n: n:4. At the shining of the river, n:Mirror of the Saviour’s face, n:Saints whom death will never sever n:Raise their songs of saving grace. n: n:5. Soon we’ll reach the silver river, n:Soon our pilgrimage will cease; n:Soon our happy hearts will quiver n:With the melody of peace."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 57,
    "Lyrics": [
      "1. Years I spent in vanity and pride, n:Caring not my Lord was crucified; n:Knowing not it was for me He died, n:On calvary. n: n:i:Mercy that was great, and grace was free, n:i:Pardon there was multiplied to me, n:i:There my burdened soul found liberty, n:i:At calvary. n: n:2. By God’s word at last my sin I learned n:Then I trembled at the law I’d spurned, n:Till my guilty soul, imploring, turned n:To calvary. n: n:3. Now I’ve given to Jesus ev’rything, n:Now I gladly own Him as my King, n:Now my raptured soul can only sing n:Of Calvary. n: n:4. Oh! the love that drew salvation’s plan, n:Oh! the grace that brought it down to man, n:Oh! the mighty gulf that God did span n:At Calvary."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 58,
    "Lyrics": [
      "1. Sing the wondrous love of Jesus, n:Sing His mercies and His grace; n:In the mansions, bright and blessed, n:He’ll prepare for us a place.... n: n:i:When we all... get to Heaven, n:i:What a day of rejoicing that will be!... n:i:When we all.... see Jesus, n:i:We’ll sing and shout the victory.... n: n:2. While we walk the pilgrim pathway, n:Clouds will overspread the sky; n:But when trav’lling days are over, n:Not a shadow, not a sigh..... n: n:3. Let us, then be true and faithful, n:Trusting, serving ev’ry day; n:Just one glimpse of Him in glory n:Will the toils of life repay.... n: n:4. Onward to the prize before us! n:Soon His beauty we’ll behold; n:Soon the pearly gates will open, n:We shall tread the streets of gold...."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 59,
    "Lyrics": [
      "1. On that bright and golden morning n:When the Son of Man shall come, n:And the radiance of His glory we shall see; n:When from every clime and nation n:He shall call His people home – n:What a gath’ring of the ransomed that will be. n: n:i:What a gath’....ring! (2) n:i:What a gath’ring of the ransomed n:i:In the summer land of love! n:i:What a gath’.....ring, what a gath’....ring n:i:Of the ransomed in that happy home above! n: n:2. When the blest who sleep in Jesus n:At His bidding shall arise n:From the silence of the grave, and from the sea; n:And with bodies all  celestial they n:Shall meet Him in the skies – n:What a gath’ring and rejoicing there will be. n: n:3. When our eyes behold the city n:With it’s “many mansions” bright, n:And its river, calm and restful, flowing free – n:When the friends that death has parted n:Shall in bliss again unite– n:What a gath’ring and a greeting there will be. n: n:4. Oh, the king is surely coming, n:And the time is drawing nigh, n:When the blessed day of promise we shall see; n:Then the changing “in a moment,” “in the twinkling of an eye,” n:And for ever in His presence we shall be."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 60,
    "Lyrics": [
      "1. Nearer, my God, to Thee, n:Nearer to Thee; n:E’en though it be a cross, n:That raiseth me, n:Still all my song shall be, n:Nearer, my God, to Thee, n:Nearer, my God, to Thee, n:Nearer to Thee. n: n:2. Though like a wanderer, n:The sun gone down, n:Darkness be over me, n:My rest a stone: n:Yet in my dreams I’d be n:Nearer, my God, to Thee, n:Nearer, my God, to Thee, n:Nearer to Thee. n: n:3. There let my way appear n:Steps unto heaven: n:All that Thou sendest me, n:In mercy given; n:Angels to beckon me, n:Nearer, my God, to Thee, n:Nearer, my God, to Thee, n:Nearer to Thee. n: n:4. Then with my waking thoughts, n:Bright with Thy praise, n:Out of my stony griefs, n:Bethel I’ll raise; n:So by my woes to be, n:Nearer, my God, to Thee, n:Nearer, my God, to Thee, n:Nearer to Thee. n: n:5. Or if on joyful wing, n:Cleaving the sky, n:Sun, moon and stars forgot, n:Upwards I fly, n:Still all my song shall be, n:Nearer, my God, to Thee, n:Nearer, my God, to Thee, n:Nearer to thee!"
    ],
    "Writer": "S. F. Adams"
  },
  {
    "SongNo": 61,
    "Lyrics": [
      "1. Yield not to temptation, for yielding is sin; n:Each victory will help you, some other to win; n:Fight manfully onward, dark passions subdue, n:Look ever to Jesus, He will carry you through. n: n:i:Ask the Saviour to help you, n:i:Comfort, strengthen, and keep you; n:i:He is willing to aid you, n:i:He will carry you through. n: n:2. Shun evil companions, bad language disdain, n:God’s name hold in reverence, nor take it in vain; n:Be thoughtful and earnest, kind–hearted and true, n:Look ever to Jesus, He will carry you through. n: n:3. To him that o’er commeth, God giveth a crown, n:Through faith we shall conquer, tho’ often cast down; n:He, who is our Saviour, our Strength will renew; n:Look ever to Jesus, He will carry you through."
    ],
    "Writer": "H. R. Palmer"
  },
  {
    "SongNo": 62,
    "Lyrics": [
      "1. He leadeth me! O blessed thought, n:O words with heav’nly comfort fraught; n:Whate’er I do where’er I be, n:Still ‘tis God’s hand that leadeth me. n: n:i:He leadeth me! He leadeth me! n:i:By His Own hand He leadeth me; n:i:His faithful follower, I would be, n:i:For by His hand He leadeth me. n: n:2. Sometimes ’mid scenes of deepest gloom, n:Sometimes where Eden’s bowers bloom, n:By waters still, o’er troubled sea, n:Still ‘tis His hands that leadeth me. n: n:3. Lord, I would clasp Thy hand in mine, n:Nor ever murmur nor repine; n:Content, whatever lot I see, n:Since ’tis my God that leadeth me. n: n:4. And when my task on earth is done; n:When, by Thy grace, the vict’ry’s won, n:E’en death’s cold wave I will not flee, n:Since Thou through Jordan leadest me."
    ],
    "Writer": "J. H. Gilmore"
  },
  {
    "SongNo": 63,
    "Lyrics": [
      "1. I am thinking to–day of that beautiful land n:I shall reach when the sun goeth down; n:When through wonderful grace by my Saviour I stand, n:Will there be any stars in my crown? n: n:i:Will there be any stars, any stars in my crown, n:i:When at evening the sun goeth down?..., n:i:When I wake with the blest n:i:In the mansions of rest; n:i:Will there be any stars, in my crown? n: n:2. In the strength of the Lord let me labour and pray, n:Let me watch as a winner of souls, n:That bright stars may be mine in the glorious day n:When His praise like the sea-billows roll. n: n:3. Oh, what joy will it be when His face I behold, n:Living gems at His feet to lay down; n:It would sweeten my bliss in the city of gold, n:Should there be any stars in my crown."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 64,
    "Lyrics": [
      "1. Come, ye that love the Lord, n:And let your joys be known, n:Join in a song with sweet accord, n:Join in a song with sweet accord, n:And thus surround the throne, n:And thus surround the throne. n: n:i:We’re marching to zion the beautiful, beautiful zion n:i:We’re marching upward to zion n:i:The beautiful city of God. n: n:2. Let those refuse to sing n:Who never knew our God; n:But children of the Heavenly King, n:But children of the Heavenly King , n:Must speak their joys abroad n:Must speak their joys abroad. n: n:3. The men of grace have found n:Glory begun below; n:Celestial fruit on earthly ground n:Celestial fruit on earthly ground n:From faith and hope may grow n:From faith and hope may grow. n: n:4. The hill of zion yields n:A thousand sacred sweets, n:Before we reach the heavenly fields, n:Before we reach the heavenly fields, n:Or walk the golden streets n:Or walk the golden streets. n: n:5. There we shall see His face n:And never, never sin; n:There from the rivers of His grace n:There from the rivers of His grace n:Drink endless pleasures in n:Drink endless pleasures in. n: n:6. Then let our songs abound, n:And every tear be dry; n:We’re marching through Immanuel’s ground, n:We’re marching through Immanuel’s ground, n:To fairer worlds on high n:To fairer worlds on high."
    ],
    "Writer": "I. Watts"
  },
  {
    "SongNo": 65,
    "Lyrics": [
      "1. When the trumpet of the Lord shall sound, n:And time shall be no more, n:And the morning breaks, eternal bright, and fair; n:When the saved of earth shall gather n:Over on the other shore, n:And the roll is called up yonder, I’ll be there. n: n:i:When the roll is called up yonder,(3) n:i:When the roll is called up yonder, n:i:I’ll be there. n: n:2. On that bright and cloudless morning, n:When the dead in Christ shall rise, n:And the glory of His resurrection share; n:When His chosen ones shall gather to their home beyond the sky, n:And the roll is called up yonder, I’ll be there. n: n:3. Let me labour for the master n:From the dawn till setting sun, n:Let me talk of all His wondrous love and care; n:Then, when all of work is over, n:And my work on earth is done, n:And the roll is called up yonder, I’ll be there."
    ],
    "Writer": "J. M. Black"
  },
  {
    "SongNo": 66,
    "Lyrics": [
      "1. Sowing in the morning, sowing seeds of kindness, n:Sowing in the noontide and the dewy eves; n:Waiting for the harvest, and the time of reaping, n:We shall come rejoicing, bringing in the sheaves! n: n:i:Bringing in the sheaves!(2) n:i:We shall come rejoicing, n:i:Bringing in the sheaves! n: n:2. Sowing in the sunshine, sowing in the shadows, n:Fearing neither clouds nor winter’s chilling breeze; n:By and by the harvest, and the labour ended, n:We shall come rejoicing, bringing in the sheaves! n: n:3. Go then ever, weeping, sowing for the Master, n:Though the loss sustained our spirit often grieves: n:When our weeping’s over, He will bid us welcome, n:We shall come rejoicing, bringing in the sheaves!"
    ],
    "Writer": "K. Shaw"
  },
  {
    "SongNo": 67,
    "Lyrics": [
      "1. How I praise Thee, precious Saviour, n:That Thy love laid hold of me; n:Thou hast sav’d and cleans’d and fill’d me, n:That I might Thy channel be. n: n:i:Channels only, blessed Master, n:i:But with all Thy wondrous pow’r n:i:Flowing through us, Thou canst use us n:i:Ev’ry day and ev’ry hour. n: n:2. Just a channel, full of blessing, n:To the thirsty hearts around; n:To tell out Thy full salvation n:All Thy loving message sound. n: n:3. Emptied that Thou shouldest fill me n:A clean vessel in Thine hand; n:With no pow’r but as Thou givest n:Graciously with each command. n: n:4. Witnessing Thy power to save me, n:Setting free from self and sin, n:Thou hast bought me to possess me n:In Thy fulness, Lord, come in. n: n:5. Jesus, fill now with Thy Spirit n:Hearts that full surrender know; n:That the streams of living water n:From our inner man may flow."
    ],
    "Writer": "M. E. Maxwell"
  },
  {
    "SongNo": 68,
    "Lyrics": [
      "1. Ho, my comrades! see the signal n:Waving in the sky! n:Reinforcements now appearing n:Victory is nigh! n: n:i:“Hold the fort, for I am coming” n:i:Jesus signals still; n:i:Wave the answer back to heaven, n:i:“By Thy grace we will!” n: n:2. See the mighty host advancing, n:Satan leading on; n:Mighty men around us falling, n:Courage almost gone! n: n:3. See the glorious banner waving! n:Hear the trumpet blow! n:In our Leader’s name we’ll triump n:Over every foe! n: n:4. Fierce and long the battle rages, n:But our help is near; n:Onward comes our great Commander, n:Cheer, my comrades, cheer!"
    ],
    "Writer": "P. P. Bliss"
  },
  {
    "SongNo": 69,
    "Lyrics": [
      "1. Sound the battle–cry, see! the foe is nigh; n:Rise the standard high for the Lord, n:Gird your armour on, stand firm everyone, n:Rest your cause, upon His holy word. n: n:i:Rouse then, soldiers! n:i:Rally round the banner! n:i:Ready, steady, pass the word along, n:i:Onward! Forward! Shout aloud Hosanna! n:i:Christ is Captain of the mighty throng. n: n:2. Strong to meet the foe, marching on we go, n:While our cause we know must prevail, n:Shield and banner bright, gleaming in the light, n:Battling for the right, we ne’er can fail. n: n:3. O Thou God of all, hear us when we call, n:Help us, one and all, by Thy grace; n:When the battle’s done, and the victory won, n:May we wear the crown before Thy face."
    ],
    "Writer": "W. F. Sherwin"
  },
  {
    "SongNo": 70,
    "Lyrics": [
      "1. Down in the valley with my Saviour I would go, n:Where the flowers are blooming and the sweet waters flow, n:Everywhere He leads me I would follow, follow on, n:Walking in His footsteps till the crown be won.  n:i:Follow! Follow! I would follow Jesus! n:i:Anywhere, everywhere, I would follow on! n:i:Follow! Follow! I would follow Jesus! n:i:Everywhere He leads me I would follow on! n: n:2. Down in the valley with my Saviour I would go, n:Where the stroms are sweeping and the dark waters flow, n:With His hands  to lead me I will never, never fear: n:Dangers cannot fright me if my Lord is near. n: n:3. Down in the valley, or upon the mountain steep, n:Close beside my Saviour, would my soul ever keep, n:He will lead me safely, in the path that He has trod, n:Up to where they gather on the hills of God."
    ],
    "Writer": "W. O. Cushing"
  },
  {
    "SongNo": 71,
    "Lyrics": [
      "1. Jesus, lover of my soul let me to Thy bosom fly, n:While the nearer waters roll, n:While the tempest still is high; n:Hide me, O my saviour, hide, n:Still the storm of life be past; n:Safe into the haven guide, n:Oh, receive my soul at last. n: n:2. Other refuge have I none, n:Hangs my helpless soul on Thee; n:Leave, ah! leave me not alone, n:Still support and comfort me; n:All my trust on Thee is stay’d, n:All my help from Thee I bring; n:Cover my defenceless head, n:With the shadow of Thy wing. n: n:3. Thou, O Christ, art all I want; n:More than all in Thee I find: n:Raise the fallen, cheer the faint, n:Heal the sick, and lead the blind. n:Just and holy is Thy name; n:I am all unrighteousness: n:Vile and full of sin I am; n:Thou art full of truth and grace. n: n:4. Plenteous grace with Thee is found; n:Grace to cover all my sin; n:Let the healing streams abound, n:Make and keep me pure within: n:Thou of life the fountain art, n:Freely let me take of Thee: n:Spring Thou up within my heart, n:Rise to all eternity."
    ],
    "Writer": "C. Wesley"
  },
  {
    "SongNo": 72,
    "Lyrics": [
      "1. There’s not a friend like the lowly Jesus, n:No, not one! No, not one! n:None else could heal all our souls diseases, n:No, not one! No, not one! n: n:i:Jesus knows all about our struggles, n:i:He will guide till the day is done; n:i:And there’s not a friend like the lowly Jesus, n:i:No, not one! No, not one! n: n:2. No friend like Him is so high and holy, n:No, not one! No, not one! n:And yet no friend is so meek and lowly, n:No, not one! No, not one! n: n:3. There’s not an hour that He is not near us, n:No, not one! No, not one! n:No night so dark, but His love can cheer us, n:No, not one! No, not one! n: n:4. Did ever a saint find this friend forsake him? n:No, not one! No, not one! n:Or sinner find that He would not take him? n:No, not one! No, not one! n: n:5. Was e’er a gift like the Saviour given? n:No, not one! No, not one! n:Will He refuse us a home in heaven? n:No, not one! No, not one!"
    ],
    "Writer": "J. Oatman"
  },
  {
    "SongNo": 73,
    "Lyrics": [
      "1. I have found a friend in Jesus, He’s everything to me; n:He’s the fairest of ten thousand to my soul! n:The “Lily of the Valley”, in Him alone I see– n:All I need to cleanse and make me fully whole; n:In sorrow He’s my comfort, in trouble He’s my stay; n:He tells me every care on Him to roll: n:He’s the “Lily of the Valley”, the “Bright and Morning Star”; n:He’s the fairest of ten thousand to my soul! n: n:i:In sorrow He’s my comfort, n:i:In trouble He’s my stay; n:i:He tells me every care on Him to roll: n:i:He’s the “Lily of the Valley”, n:i:The “Bright and Morning Star”, n:i:He’s the fairest of ten thousand to my soul! n: n:2. He all my grief has taken, and all my sorrows borne: n:In temptation He’s my strong and mighty tower; n:I’ve all for Him forsaken, I’ve all my idols torn n:From my heart–and now He keeps me by His power. n:Though all the world forsake me, and Satan tempt me sore, n:Through Jesus I shall safely reach the goal. n:He’s the “Lily of the Valley”, the “Bright and Morning Star”, n:He’s the fairest of ten thousand to my soul! n: n:3. He’ll never, never leave me nor yet forsake me here, n:While I live by faith, and do His blessed will; n:A wall of fire about me, I’ve nothing now to fear; n:With His manna He my hungry soul shall fill. n:When crowned at last in glory, I’ll see His blessed face, n:Where rivers of delight shall ever roll. n:He’s the “Lily of the Valley”, the “Bright and Morning Star”, n:He’s the fairest of ten thousand to my soul!"
    ],
    "Writer": "C. W. Fry"
  },
  {
    "SongNo": 74,
    "Lyrics": [
      "1. All to Jesus I surrender, all to Him I freely give; n:I will ever love and trust Him, in His presence daily live. n: n:i:I surrender all, I surrender all; n:i:All to Thee, my blessed Saviour, n:i:I surrender all. n: n:2. All to Jesus I surrender, humbly at His feet I bow; n:Worldly pleasures all forsaken–take me, Jesus, take me now. n: n:3. All to Jesus I surrender, make me Saviour, wholly Thine; n:Let the Holy Spirit witness I am Thine and Thou art mine. n: n:4. All to Jesus I surrender: Lord, I give myself to Thee; n:Fill me with Thy love and power, let Thy blessing rest on me. n: n:5. All to Jesus I surrender, now I feel Thy sacred flame; n:Oh the joy of full salvation! glory, glory to His name!"
    ],
    "Writer": "J. W. Van de Venter"
  },
  {
    "SongNo": 75,
    "Lyrics": [
      "1. I am Thine O Lord, I have heard Thy voice, n:And it told Thy love to me; n:But I longed to rise, in the arms of faith, n:And be closer drawn to Thee. n: n:i:Draw me nea….rer, nearer, Blessed Lord, n:i:To the cross where Thou hast died: n:i:Draw me nearer, nearer, nearer, Blessed Lord, n:i:To Thy precious, wounded side. n: n:2. Consecrate me now to Thy service, Lord, n:By the power of grace divine; n:Let my soul look up with a steadfast hope, n:And my will be lost in Thine. n: n:3. Oh, the pure delight of a single hour n:That before Thy throne I spend, n:When I kneel in prayer, and with Thee, my God, n:I commune as friend with friend. n: n:4. There are depths of love that I cannot know n:Till I cross the narrow sea; n:There are heights of joy that I may not reach n:Till I rest in peace with Thee."
    ],
    "Writer": "F. J. Crosby"
  },
  {
    "SongNo": 76,
    "Lyrics": [
      "1. Naught have I gotten but what I received; n:Grace hath bestow’d it since I have believed; n:Boasting excluded, pride I abase; n:I’m only a sinner, saved by grace. n: n:i:Only a sinner saved by grace! n:i:Only a sinner saved by grace! n:i:This is my story - to God be the glory- n:i:I’m only a sinner saved by grace! n: n:2. Once I was foolish, and sin ruled my heart, n:Causing my footsteps from God to depart; n:Jesus hath found me, happy my case n:I now am a sinner, saved by grace! n: n:3. Tears  unavailing, no merit had I; n:Mercy had saved me, or else I must die; n:Sin had alarmed me, fearing God’s face; n:But now I’m a sinner, saved by grace. n: n:4. Suffer a sinner whose heart overflows, n:Loving his Saviour, to tell what He knows; n:Once more to tell it, would I embrace – n:I’m only a sinner, saved by grace."
    ],
    "Writer": "J. M. Gray"
  },
  {
    "SongNo": 77,
    "Lyrics": [
      "1. O happy day that fixed my choice n:On Thee, my Saviour and my God! n:Well may this glowing heart rejoice, n:And tell its raptures all abroad. n: n:i:Happy day, happy day, n:i:When Jesus wash’d my sins away! n:i:He teaches me to watch and pray; n:i:And live rejoicing every day. n:i:Happy day, happy day, n:i:When Jesus wash’d my sins away! n: n:2. O happy bond, that seals my vows n:To Him who merits all my love; n:Let cheerful anthems fill His house, n:While to that sacred shrine I move. n: n:3. ‘Tis done, the great transaction’s done, n:I am my Lord’s, and He is mine; n:He drew me, and I followed on, n:Charmed to confess the voice divine. n: n:4. Now rest, my long-divided heart; n:Fixed on this blissful centre, rest; n:Nor ever from Thy Lord depart, n:With Him of every good possessed. n: n:5. High heaven, that heard that solemn vow, n:That vow renewed shall daily hear; n:Till in life’s latest hour I bow, n:And bless in death a bond so dear."
    ],
    "Writer": "P. Doddridge"
  },
  {
    "SongNo": 78,
    "Lyrics": [
      "1. O Christ, in Thee my soul hath found, n:And found in Thee alone, n:The peace, the joy I sought so long, n:The bliss till now unknown. n: n:i:Now none but Christ can satisfy, n:i:None other name for me; n:i:There’s love and life and lasting joy, n:i:Lord Jesus, found in Thee. n: n:2. I sighed for rest and happiness n:I yearned for them, not Thee, n:But while I passed my Saviour by, n:His love laid hold on me. n: n:3. I tried the broken cisterns, Lord, n:But, ah, the waters failed! n:E’en as I stooped to drink they fled, n:And mocked me as I wailed. n: n:4. The pleasures lost I sadly mourned, n:But never wept for Thee, n:Till grace the sightless eyes received, n:Thy loveliness to see."
    ],
    "Writer": "B. E."
  },
  {
    "SongNo": 79,
    "Lyrics": [
      "1. When peace like a river attendeth my way, n:When sorrows like sea billows roll; n:Whatever my lot Thou hast taught me to say, n:“It is well, it is well with my soul!” n: n:i:It is well with my soul! n:i:It is well with my soul! n:i:It is well, it is well with my soul! n: n:2. Though Satan should buffet, tho’ trial should come; n:Let this blest assurance control, n:That Christ hath regarded my helpless estate, n:And hath shed His own blood for my soul. n: n:3. My sin – oh, the bliss of this glorious thought– n:My sin, not in part, but the whole, n:Is nailed to His Cross, and I bear it no more; n:Praise the Lord, praise the Lord, O my soul! n: n:4. For me, be it Christ, be it Christ, hence to live; n:If Jordan above me shall roll, n:No pang shall be mine, for in death as in life n:Thou wilt whisper Thy peace to my soul. n: n:5. But, Lord, ’tis for Thee, for Thy coming, we wait; n:The sky, not the grave, is our goal: n:Oh, trump of the Angel! oh, voice of the Lord! n:Blessed hope! blessed rest of my soul!"
    ],
    "Writer": "H. G. Spafford"
  },
  {
    "SongNo": 80,
    "Lyrics": [
      "1. Will your anchor hold in the storms of life? n:When the clouds unfold their wings of strife; n:When the strong tides lift and the cables strain, n:Will your anchor drift, or firm remain? n: n:i:We have an anchor that keeps the soul n:i:Steadfast and sure while the billows roll; n:i:Fastened to the rock which cannot move, n:i:Grounded firm and deep in the Saviour’s love! n: n:2. Will your anchor hold in the straits of fear? n:When the breakers roar and the reef is near; n:While the surges rave, and the wild winds blow, n:Shall the angry wave then your bark o’erflow? n: n:3. Will our anchor hold in the folds of death, n:When the waters cold chill your latest breath? n:On the rising tide you can never fail, n:While your anchor holds within the veil. n: n:4. Will your eyes behold through the morning light n:The city of gold, and the harbour bright? n:Will you anchor safe by the heavenly shore, n:When life’s storms are past for evermore?"
    ],
    "Writer": "P. J. Owens"
  },
  {
    "SongNo": 81,
    "Lyrics": [
      "1. What a wonderful change in my life has been wrought n:Since Jesus came into my heart! n:I have light in my soul for which long I had sought, n:Since Jesus came into my heart! n: n:i:Since Jesus came into my heart, n:i:Since Jesus came into my heart, n:i:Floods of joy o’er my soul like the sea billows roll, n:i:Since Jesus came into my heart. n: n:2. I have ceased from my wand’ring and going astray, n:Since Jesus came into my heart! n:And my sins which were many are all washed away n:Since Jesus came into my heart! n: n:3. I’m possessed of a hope that is steadfast and sure, n:Since Jesus came into my heart! n:And no dark clouds of doubt now my pathway obscure, n:Since Jesus came into my heart! n: n:4. There’s a light in the valley of death now for me, n:Since Jesus came into my heart! n:And the gates of the City beyond I can see, n:Since Jesus came into my heart! n: n:5. I shall go there to dwell in that City I know, n:Since Jesus came into my heart! n:And I’m happy, so happy as onward I go, n:Since Jesus came into my heart!"
    ],
    "Writer": "R. H. McDaniel"
  },
  {
    "SongNo": 82,
    "Lyrics": [
      "1. Come, Thou Fount of every blessing, n:Tune my heart to sing Thy grace; n:Streams of mercy never ceasing n:Call for songs of loudest praise. n:Teach me some melodious measure n:Sung by flaming tongues above; n:O the vast, the boundless treasure n:Of my Lord’s unchanging love! n: n:2. Here I raise my Ebenezer; n:Hither by Thy help I’m come; n:And I hope, by Thy good pleasure, n:Safely to arrive at home. n:Jesus sought me when a stranger, n:Wandering from the fold of God. n:He, to rescue me from danger, n:Interposed His precious blood. n: n:3. O to grace how great a debtor n:Daily I’m constrained to be! n:Let that grace, Lord, like a fetter, n:Bind my wandering heart to Thee; n:Prone to wander, Lord, I feel it, n:Prone to leave the God I love; n:Take my heart, O take and seal it, n:Seal it for Thy courts above."
    ],
    "Writer": "R. Robinson"
  },
  {
    "SongNo": 83,
    "Lyrics": [
      "1. I will sing the wondrous story n:Of the Christ who died for me; n:How He left His home in glory, n:For the cross on Calvary. n: n:i:Yes I’ll sing the wondrous story n:i:Of the Christ who died for me; n:i:Sing it with the saints in glory, n:i:Gathered by the crystal sea. n: n:2. I was lost; but Jesus found me– n:Found the sheep that went astray; n:Threw His loving arms around me, n:Drew me back into His way. n: n:3. I was bruised: but Jesus healed me– n:Faint was I from many a fall; n:Sight was gone, and fears possessed me: n:But He freed me from them all. n: n:4. Days of darkness still come o’er me; n:Sorrow’s paths I often tread; n:But the Saviour still is with me, n:By His hand I’m safely led. n: n:5. He will keep me till the river n:Rolls its waters at my feet; n:Then He’ll bear me safely over, n:Where the loved ones I shall meet."
    ],
    "Writer": "R. H. Rawley"
  },
  {
    "SongNo": 84,
    "Lyrics": [
      "1. What can wash away my stain? n:Nothing but the blood of Jesus! n:What can make me whole again? n:Nothing but the blood of Jesus! n: n:i:Oh, precious is the flow, n:i:That makes me white as snow! n:i:No other fount I know, n:i:Nothing but the blood of Jesus! n: n:2. For my cleansing this I see – n:Nothing but the blood of Jesus! n:For my pardon this my plea– n:Nothing but the blood of Jesus! n: n:3. Nothing can for sin atone – n:Nothing but the blood of Jesus! n:Naught of good that I have done – n:Nothing but the blood of Jesus! n: n:4. This is all my hope and peace – n:Nothing but the blood of Jesus! n:This is all my righteousness – n:Nothing but the blood of Jesus!"
    ],
    "Writer": "R. Lowry"
  },
  {
    "SongNo": 85,
    "Lyrics": [
      "1. Jesus loves me! this I know, n:For the Bible tells me so; n:Little ones to Him belong, n:They are weak, but He is strong. n: n:i:Yes, Jesus loves me! n:i:Yes, Jesus loves me! n:i:Yes, Jesus loves me! n:i:The Bible tells me so. n: n:2. Jesus loves me! He who died, n:Heaven’s gate to open wide; n:He will wash away my sin, n:Let His little child come in. n: n:3. Jesus loves me! He will stay n:Close beside me, all the way; n:If I love Him, when I die n:He will take me home on high."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 86,
    "Lyrics": [
      "1. Pass me not, O gentle Saviour, n:Hear my humble cry; n:While on others Thou art calling, n:Do not pass me by. n: n:i:Saviour, Saviour! n:i:Hear my humble cry. n:i:And while others Thou art calling, n:i:Do not pass me by. n: n:2. Let me at the throne of mercy n:Find a sweet relief; n:As I kneel in deep contrition, n:Help my unbelief. n: n:3. Trusting only in Thy merit, n:Would I seek Thy face; n:Heal my wounded, broken spirit, n:Save me by Thy grace. n: n:4. Thou the spring of all my comfort, n:More than life to me; n:Whom have I on earth beside Thee? n:Whom in heaven but Thee?"
    ],
    "Writer": "F. J.Crosby"
  },
  {
    "SongNo": 87,
    "Lyrics": [
      "1. I hear Thy welcome voice, n:That calls me, Lord, to Thee, n:For cleansing in Thy precious blood n:That flowed on Calvary. n: n:i:I am coming, Lord, n:i:Coming now to Thee; n:i:Wash me, cleanse me in the blood n:i:That flowed from Calvary. n: n:2. Though coming weak and vile, n:Thou dost my strength assure; n:Thou dost my vileness fully cleanse, n:Till spotless all, and pure. n: n:3. ’Tis Jesus calls me on n:To perfect faith and love, n:To perfect hope, and peace, and trust, n:For earth and heaven above. n: n:4. ’Tis Jesus who confirms n:The blessed work within, n:By adding grace to welcomed grace, n:Where reigned the power of sin. n: n:5. All hail, atoning blood! n:All hail, redeeming grace! n:All hail, the gift of Christ our Lord, n:Our strength and righteousness."
    ],
    "Writer": "L. Hartsough"
  },
  {
    "SongNo": 88,
    "Lyrics": [
      "1. Rock of Ages, cleft for me, n:Let me hide myself in Thee; n:Let the water and the blood, n:From Thy wounded side which flowed, n:Be of sin the double cure, n:Cleanse me from its guilt and power. n: n:2. Not the labor of my hands n:Can fulfil Thy laws demand; n:Could my zeal no respite know, n:Could my tears for ever flow, n:All for sin could not atone; n:Thou must save, and Thou alone. n: n:3. Nothing in my hand I bring, n:Simply to the cross I cling; n:Naked, come to Thee for dress, n:Helpless look to Thee for grace; n:Foul, I to the fountain fly, n:Wash me, Saviour, or I die. n: n:4. While I draw this fleeting breath, n:When mine eyes shall close in death, n:When I soar to worlds unknown, n:See Thee on the judgement throne; n:Rock of Ages, cleft for me, n:Let me Hide myself in Thee."
    ],
    "Writer": "A. M. Toplady"
  },
  {
    "SongNo": 89,
    "Lyrics": [
      "1. Marvellous grace of our loving Lord, n:Grace that exceeds our sin and our guilt, n:Yonder on Calvary’s mount outpoured , n:There where the blood of the Lamb was spilt. n: n:i:Grace, grace, God’s grace, n:i:Grace that will pardon and cleanse within; n:i:Grace, grace, God’s grace, n:i:Grace that is greater than all our sin. n: n:2. Sin and despair like the sea waves cold, n:Threaten the soul with infinite loss; n:Grace that is greater, yes, grace untold, n:Points to the Refuge, the mighty Cross. n: n:3. Dark is the stain that we cannot hide, n:What can avail to wash it away? n:Look! there is flowing a crimson tide, n:Whiter than snow you may be today. n: n:4. Marvellous, infinite, matchless grace, n:Freely bestowed on all who believe; n:You that are longing to see His face, n:Will you this moment His grace receive?"
    ],
    "Writer": "J. . H. Johnston"
  },
  {
    "SongNo": 90,
    "Lyrics": [
      "1. We have heard a joyful sound, n:Jesus saves! Jesus saves! n:Spread the gladness all around, n:Jesus saves! Jesus saves! n:Bear the news to ev’ry land; n:Climb the steeps and cross the waves; n:Onward! ’tis our Lord’s command: n:Jesus saves! Jesus saves! n: n:2. Waft it on the rolling tide, n:Jesus saves! Jesus saves! n:Tell to sinners, far and wide, n:Jesus saves! Jesus saves! n:Sing, ye islands of the sea! n:Echo back, ye ocean caves! n:Earth shall keep the jubilee: n:Jesus saves! Jesus saves! n: n:3. Sing above the battle’s strife, n:Jesus saves! Jesus saves! n:By His death and endless life, n:Jesus saves! Jesus saves! n:Sing it softly through the gloom, n:When the heart for mercy craves; n:Sing in triumph o’er the tomb, n:Jesus saves! Jesus saves! n: n:4. Give the winds a mighty voice, n:Jesus saves! Jesus saves! n:Let the nations now rejoice; n:Jesus saves! Jesus saves! n:Shout salvation full and free, n:Every shore that ocean laves; n:This our song of Victory: n:Jesus saves! Jesus saves!"
    ],
    "Writer": "P. J. Owens"
  },
  {
    "SongNo": 91,
    "Lyrics": [
      "1. When we walk with the Lord, n:In the light of His word, n:What a glory He sheds on our way; n:While we do His good will n:He abides with us still, n:And with all who will trust and obey. n: n:i:Trust and obey, n:i:For there’s no other way n:i:To be happy in Jesus, n:i:But to trust and obey. n: n:2. Not a shadow can rise, n:Not a cloud in the skies, n:But His smile quickly drives it away; n:Not a doubt nor a fear n:Not a sigh nor a tear, n:Can abide while we trust and obey. n: n:3. Not a burden we bear, n:Not a sorrow we share, n:But our toil He doth richly repay n:Not a grief nor a loss, n:Not a frown nor a cross, n:But is blest if we trust and obey. n: n:4. But we never can prove n:The delights of His love, n:Until all on the altar we lay; n:For the favour He shows, n:And the joy He bestows, n:Are for them who will trust and obey. n: n:5. Then in fellowship sweet n:We will sit at His feet, n:Or we’ll walk by His side in the way; n:What He says we will do; n:Where He sends, we will go, n:Never fear, only trust and obey."
    ],
    "Writer": "J. H. Sammis"
  },
  {
    "SongNo": 92,
    "Lyrics": [
      "1. There’s a land that is fairer than day, n:And by faith we can see it afar; n:For the Father waits over the way, n:To prepare us a dwelling-place there. n: n:i:In the sweet.... by-and-by.... n:i:We shall meet on that beautiful shore... n:i:In the sweet.... by-and-by..... n:i:We shall meet on that beautiful shore. n: n:2. We shall sing on that beautiful shore n:The melodious songs of the blest, n:And our spirits shall sorrow no more – n:Not a sigh for the blessing of rest. n: n:3. To our bountiful Father above n:We will offer a tribute of praise, n:For the glorious gift of His love n:And the blessings that hallow our days."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 93,
    "Lyrics": [
      "1. “Man of sorrows!” what a name n:For the son of God, who came n:Ruined sinners to reclaim! n:Hallelujah! what a Saviour! n: n:2. Bearing shame and scoffing rude, n:In my place condemned He stood: n:Sealed my pardon with His blood: n:Hallelujah! what a Saviour! n: n:3. Guilty, vile, and helpless, we; n:Spotless Lamb of God was He n:Full atonement, – can it be? n:Hallelujah! what a Saviour! n: n:4. Lifted up was He to die, n:“It is finished!” was His cry: n:Now in heaven exalted high: n:Hallelujah! what a Saviour! n: n:5. When He comes, our glorious King, n:All His ransomed home to bring, n:Then anew, this song we’ll sing: n:“Hallelujah! what a Saviour!”"
    ],
    "Writer": "P. P. Bliss"
  },
  {
    "SongNo": 94,
    "Lyrics": [
      "1. Oh, the deep, deep love of Jesus! n:Vast, unmeasured, boundless, free: n:Rolling as a mighty ocean n:In its fullness over me. n:Underneath me, all around me, n:Is the current of His love; n:Leading onward, leading home-ward, n:To my glorious rest above. n: n:2. Oh, the deep, deep love of Jesus! n:Spread His praise from shore to shore; n:How He loveth, ever loveth, n:Changeth never, nevermore; n:How He watcheth o’er His loved ones, n:Died to call them all His own; n:How for them He intercedeth, n:Watcheth o’er them from the throne. n: n:3. Oh, the deep, deep love of Jesus! n:Love of every love the best; n:’Tis an ocean, vast of blessing, n:’Tis a heaven sweet of rest. n:Oh, the deep, deep love of Jesus! n:’Tis a heaven of heavens to me; n:And it lifts me up to glory, n:For it lifts me up to Thee."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 95,
    "Lyrics": [
      "1. Have Thine own way, Lord, n:Have Thine own way; n:Thou art the potter, I am the clay. n:Mould me and make me n:After Thy will, n:While I am waiting n:Yielded and still. n: n:2. Have Thine own way, Lord, n:Have Thine own way; n:Search me and try me, n:Master, today, whiter than snow, Lord, n:Wash me just now, n:As in Thy presence n:Humbly I bow. n: n:3. Have Thine own way, Lord, n:Have Thine own way; n:Wounded and weary, help me, I pray n:Power, all power, surely is Thine, n:Touch me and heal me, n:Saviour divine. n: n:4. Have Thine own way, Lord, n:Have Thine own way; n:Hold o’er my being absolute sway. n:Fill with Thy spirit, till all shall see n:Christ only, always, n:Living in me."
    ],
    "Writer": "A. A. Pollard"
  },
  {
    "SongNo": 96,
    "Lyrics": [
      "1. A wonderful Saviour is Jesus, my Lord, n:A wonderful Saviour to me; n:He hideth my soul in the cleft of the rock, n:Where rivers of pleasure I see. n: n:i:He hideth my soul in the cleft of the rock, n:i:That shadows a dry, thirsty land; n:i:He hideth my life in the depths of His love, n:i:And covers me there with His hand. n: n:2. A wonderful Saviour is Jesus, my Lord, n:He taketh my burden away; n:He holdeth me up, and I shall not be moved, n:He giveth me strength as my day. n: n:3. With numberless blessings each moment He crowns, n:And, filled with His goodness divine, n:I sing in my rapture, Oh, glory to God n:For such a Redeemer as mine! n: n:4. When clothed in His brightness, transported I rise n:To meet Him in clouds of the sky, n:His perfect salvation, His wonderful love, n:I’ll shout with the millions on high."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 97,
    "Lyrics": [
      "1. All the way my Saviour leads me: n:What have I to ask beside? n:Can I doubt His tender mercy, n:Who through life has been my Guide? n:Heavenly peace, divinest comfort, n:Hereby faith in Him to dwell! n:For I know whate’er befall me, n:Jesus doeth all things well. n: n:2. All the way my Saviour leads me: n:Cheers each winding path I tread; n:Gives me grace for every trial, n:Feeds me with the living bread. n:Though my weary steps may falter, n:And my soul a-thirst may be, n:Gushing from the Rock before me, n:Lo! a spring of joy I see. n: n:3. All the way my Saviour leads me: n:Oh, the fullness of His love! n:Perfect rest to me is promised n:In my Father’s house above. n:When my spirit, clothed immortal, n:Wings its flight to realms of day, n:This, my song through endless ages n:Jesus, led me all the way."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 98,
    "Lyrics": [
      "1. Meekness and Majesty, Manhood and Deity n:In perfect harmony, the Man who is God n:Lord of eternity, dwells in humanity n:Kneels in humility and washes our feet. n: n:i:Oh what a mystery, n:i:Meekness and majesty n:i:Bow down and worship n:i:For this is your God. n: n:2. Father’s pure radiance, perfect in innocence n:Yet learns obedience, to death on a cross n:Suffering to give us life, conquering through sacrifice n:And as they crucify prays’ “Father forgive”. n: n:3. Wisdom unsearchable, God the invisible n:Love indestructible, in frailty appears n:Lord of infinity, stooping so tenderly n:Lifts our humanity, to the heights of His throne."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 99,
    "Lyrics": [
      "1. Some day the silver cord will break, n:And I no more as now shall sing; n:But oh, the joy when I shall wake n:Within the palace of the King! n: n:i:And I shall see... Him face to face... n:i:And tell the story – saved by grace! n:i:And I shall see... Him face to face.... n:i:And tell the story – saved by grace. n: n:2. Some day my earthly house will fall, n:I cannot tell how soon ’twill be; n:But this I know – my All in All n:Has now a place in heaven for me. n: n:3. Some day, when fades the golden sun n:Beneath the rosy-tinted west, n:My blessed Lord shall say, “well done! n:And I shall enter into rest”. n: n:4. Some day; till then I’ll watch and wait– n:My lamp all trimmed and burning bright – n:That when my Saviour opens the gate, n:My soul to Him may take its flight."
    ],
    "Writer": "Anon"
  },
  {
    "SongNo": 100,
    "Lyrics": [
      "1. Lead us Lord onward Lord n:As our eyes are fixed on you n:Plant our footsteps firmly Lord n:To walk with You n:Take us Lord, further Lord n:As our hands reach out to You n:Lift us higher, Lord our hearts reach upto You. n: n:i:Hand in hand with each other n:i:We will go in Jesus name n:i:With our hearts held together n:i:Lord Your promises we claim n:i:Take us Lord, higher Lord n:i:As our eyes look up to You n:i:Move us on in step with You n:i:Lord, lead us on. n: n:2. Fill us Lord, touch us Lord n:Make our hearts with Your’s to beat n:Reaching out in love n:We’ll touch a world in need n:Show us Lord, teach us Lord n:Give direction for the way n:Moving onward Lord to serve from day to day."
    ],
    "Writer": "Anon"
  }
]